app/views/genres/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."genre_id" = $1  [["genre_id", 122]]
---
<ul class="song_index_ul">
  <% @genre.songs.each do |song| %>