app/views/users/show.html.erb

  <ul class="genre_index_ul">
    <% @user.genres.each do |g| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_users" ON "genres"."id" = "genres_users"."genre_id" WHERE "genres_users"."user_id" = $1  [["user_id", 37]]