app/views/songs/_form.html.erb

<select name="song[genre_id]">
  <%= Genre.all.each do |genre| %>
---
SELECT "genres".* FROM "genres"