app/views/songs/_form.html.erb

SELECT "genres".* FROM "genres"
---
      <select  name="song[genre_id]">
        <% Genre.all.each do |g| %>