app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
---
  def fetch_user
    # Step 1. check if session[:user_id] is set and valid
    if session[:user_id].present?
    # Step 2. if present save current user as instance globally scoping it
    # making the login status avaliable everywhere
      @current_user = User.find_by id: session[:user_id]
    end
    # Step 2. if id did not return a valid user
    # delete the session (clear the ID from the session HASH)
    unless @current_user.present?