app/controllers/concerts_controller.rb

  def map
    # all conerts need address
    @concerts = Concert.select(:name, :latitude, :longitude)
---
SELECT "concerts"."name", "concerts"."latitude", "concerts"."longitude" FROM "concerts"