app/controllers/genres_controller.rb

  def create

    genre = Genre.create genre_params
---
INSERT INTO "genres" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Punk"], ["description", "PunkY"], ["created_at", "2020-01-14 07:31:22.981919"], ["updated_at", "2020-01-14 07:31:22.981919"]]

  def index
    @current_user
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def show
    # raise "Hell"
    @user_id = params[:user_id]
    @genre = Genre.find params[:id]
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]

  def edit
    @genre = Genre.find params[:id]
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 143], ["LIMIT", 1]]

  def update
    # find the genre to be edited
    # genre = Genre.find params[:id]
    # edit genre
    # raise 'hell'
    genre = @current_user.genres.find params[:id]
    genre.update genre_params
---
SELECT  "genres".* FROM "genres" INNER JOIN "genres_users" ON "genres"."id" = "genres_users"."genre_id" WHERE "genres_users"."user_id" = $1 AND "genres"."id" = $2 LIMIT $3  [["user_id", 52], ["id", 143], ["LIMIT", 1]]
UPDATE "genres" SET "image" = $1, "updated_at" = $2 WHERE "genres"."id" = $3  [["image", "https://artist1.jango.com/698/6986b47fcb812c027079214b19a960ab.jpg"], ["updated_at", "2020-01-14 22:37:12.286387"], ["id", 145]]

  def destroy
    Genre.destroy params[:id]
---
DELETE FROM "genres" WHERE "genres"."id" = $1  [["id", 144]]