app/controllers/genres_controller.rb

  def create

    genre = Genre.create genre_params
    @current_user.genres << genre
    if params[:file].present?
      # go to cloudinary ask for the image file
      req = Cloudinary::Uploader.upload(params[:file])
      # query to cloudinary from public id (image id in cloudinary)
      genre.image = req["public_id"]

      end #if

      genre.save
---
UPDATE "genres" SET "updated_at" = $1, "image" = $2 WHERE "genres"."id" = $3  [["updated_at", "2020-01-15 03:11:43.567287"], ["image", "sgqzrnjrc9inkr0h4rvy"], ["id", 166]]

  def update
    # find the genre to be edited
    # genre = Genre.find params[:id]
    # edit genre
    # raise 'hell'
    genre = @current_user.genres.find params[:id]
    genre.update genre_params
    if params[:file].present?
      # go to cloudinary ask for the image file
      req = Cloudinary::Uploader.upload(params[:file])
      # query to cloudinary from public id (image id in cloudinary)
      genre.image = req["public_id"]

      end #if

      genre.save
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 167], ["LIMIT", 1]]
UPDATE "genres" SET "updated_at" = $1, "image" = $2 WHERE "genres"."id" = $3  [["updated_at", "2020-01-15 03:42:41.462125"], ["image", "t1xbb4i0miszhip5la1k"], ["id", 168]]

  def destroy
    Genre.destroy params[:id]
---
DELETE FROM "genres" WHERE "genres"."id" = $1  [["id", 168]]