app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "harry@hotmail.com"], ["LIMIT", 1]]
---
  def create
    # create a session (period of logged in)
    #  get email and user by email
    user = User.find_by email: params[:email]