app/controllers/songs_controller.rb

    def new
      @song = Song.new
      @genre = Genre.find params[:genre_id]
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 129], ["LIMIT", 1]]

    def create
      song = Song.create song_params
      last_id = Song.last.genre_id
      if params[:file].present?
        # go to cloudinary ask for the image file
        req = Cloudinary::Uploader.upload(params[:file])
        # query to cloudinary from public id (image id in cloudinary)
        song.image = req["public_id"]

        end #if

        song.save
---
INSERT INTO "songs" ("name", "artist", "sheet", "created_at", "updated_at", "genre_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Highway to Hell"], ["artist", "Rolling Stones"], ["sheet", "qfqe"], ["created_at", "2020-01-15 02:38:24.089305"], ["updated_at", "2020-01-15 02:38:24.089305"], ["genre_id", 156]]
SELECT  "songs".* FROM "songs" ORDER BY "songs"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "songs" SET "updated_at" = $1, "image" = $2 WHERE "songs"."id" = $3  [["updated_at", "2020-01-15 03:40:52.019502"], ["image", "srqai3ygkj0wrc6r812r"], ["id", 328]]

    def show
      song = Song.find params[:id]
      @genre_id = song.genre_id
      genre = Genre.find @genre_id
      @genre_name = genre.name
      @song = Song.find params[:id]
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 162], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 288], ["LIMIT", 1]]

    def edit

      @song = Song.find params[:id]
      @genre_id = @song.genre_id
      genre = Genre.find @genre_id
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 279], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 162], ["LIMIT", 1]]

    def update
      # find the songs to be edited
      song = Song.find params[:id]
      # edit genre
      genre_id = song.genre_id
      song.update song_params
      if params[:file].present?
        # go to cloudinary ask for the image file
        req = Cloudinary::Uploader.upload(params[:file])
        # query to cloudinary from public id (image id in cloudinary)
        song.image = req["public_id"]

        end #if

        song.save
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 327], ["LIMIT", 1]]
UPDATE "songs" SET "sheet" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["sheet", "Substitute sheeeeet"], ["updated_at", "2020-01-14 23:29:25.035908"], ["id", 306]]
UPDATE "songs" SET "updated_at" = $1, "image" = $2 WHERE "songs"."id" = $3  [["updated_at", "2020-01-15 03:41:48.953226"], ["image", "kmhqn0jv85gxngvnj4ch"], ["id", 327]]

    def destroy

      song = Song.find params[:id]
      genre_id = song.genre_id

      Song.destroy params[:id]
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 357], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 357]]