app/controllers/songs_controller.rb

    def destroy
      Song.destroy params[:id]
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 69]]