app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
    def show
      song = Song.find params[:id]

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 318]]
---
    def destroy

      song = Song.find params[:id]
      genre_id = song.genre_id

      Song.destroy params[:id]