app/controllers/users_controller.rb

  def create
    # create user and save to instance varible
    @user = User.create user_params
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
# raise "hell"
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

  def destroy
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]